### Task1

In [4]:
import numpy as np

In [81]:
a = np.array([[1, 2], 
              [2, 8],
             [3, 11],
             [3, 10],
             [1, 7]])

In [82]:
print(a)

[[ 1  2]
 [ 2  8]
 [ 3 11]
 [ 3 10]
 [ 1  7]]

In [83]:
a.shape

(5, 2)

In [84]:
mean_a = np.mean(a, axis=0)

In [85]:
print(mean_a)

[2.  7.6]

### Task2

In [86]:
a_centered = a - mean_a

In [87]:
print(a_centered)

[[-1.  -5.6]
 [ 0.   0.4]
 [ 1.   3.4]
 [ 1.   2.4]
 [-1.  -0.6]]

### Task3

In [88]:
a_centered_sp = np.sum(a_centered[:5, :1] * a_centered[:5, 1:2])

In [89]:
print(a_centered_sp/(a.shape[0]-1))

3.0

### Task4

In [90]:
print(np.cov(a.T)[0,1])

3.0

### Task5

In [92]:
import pandas as pd

In [96]:
authors = pd.DataFrame({'author_id':[1, 2, 3],
                  'author_name':['Тургенев', 'Чехов', 'Островский']}, columns=['author_id','author_name'])

In [105]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [101]:
book = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3],
                  'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
                    'price':[450, 300, 350, 500, 450, 370, 290]}, columns=['author_id','book_title','price'])

In [106]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

### Task6

In [103]:
authors_price = pd.merge(authors, book, on='author_id', how='inner')

In [104]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

### Task7

In [112]:
top5 = authors_price.sort_values(by='price', ascending=False).head()

In [113]:
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

### Task8

In [116]:
authors_stat = authors_price.groupby(['author_name'], as_index=False) \
    .agg({'price' : ['min', 'max', 'mean']})

In [117]:
authors_stat

  author_name price
                min  max        mean
0  Островский   290  370  330.000000
1    Тургенев   300  450  366.666667
2       Чехов   450  500  475.000000

### Task9

In [118]:
authors_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']

In [119]:
authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [134]:
book_info = pd.pivot_table(authors_price, values='price', index='author_name', columns='cover', aggfunc='sum').fillna(0)

In [135]:
book_info

cover        мягкая  твердая
author_name
Островский    660.0      0.0
Тургенев      650.0    450.0
Чехов           0.0    950.0

In [136]:
book_info.to_pickle('book_info.pkl')

In [137]:
book_info2 = pd.read_pickle('book_info.pkl')

In [139]:
book_info2

cover        мягкая  твердая
author_name
Островский    660.0      0.0
Тургенев      650.0    450.0
Чехов           0.0    950.0

In [138]:
book_info == book_info2

cover        мягкая  твердая
author_name
Островский     True     True
Тургенев       True     True
Чехов          True     True